### SQLITE3 DATA SOURCE

In [5]:
import sqlite3
import mysql.connector
import pymongo
import pandas as pd

In [6]:
con = sqlite3.connect('employees.db')

In [7]:
cursor = con.cursor()

In [9]:
#cursor.execute("CREATE TABLE HR(id integer PRIMARY KEY, name text, status text, salary real, department text, position text, hireDate text)")
con.commit()

In [11]:
counter = True
while counter:
    user_id = int(input('Enter your ID: '))
    name = input('Enter your name: ')
    status = input('Enter your status: ')
    salary = float(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    entities = (user_id,name,status,salary,department,position,date)
    cursor.execute("INSERT INTO HR(id,name,status,salary,department,position,hireDate) VALUES(?,?,?,?,?,?,?)",entities)
    con.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your ID: 05
Enter your name: paul
Enter your status: YEs
Enter your salary: 4000
Enter your department: IT
Enter your position: MD
Enter date "YYYY-M-D": 2021-08-09
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

In [12]:
cursor.execute('SELECT * FROM HR')
rows = cursor.fetchall()

In [13]:
for row in rows:
    print(row)
    print(row[0])

(1, 'Adunni', 'Yes', 3000.0, 'IT', 'SR', '2021-02-04')
1
(2, 'Mercy ', 'Yes', 2000.0, 'IT', 'MG', '2021-06-08')
2
(3, 'Kayus', 'Yes', 20000.0, 'Technical', 'Hr', '2021-09-03')
3
(4, 'Kilanko', 'Yes', 40000.0, 'Technical', 'Hr', '2021-05-09')
4
(5, 'paul', 'YEs', 4000.0, 'IT', 'MD', '2021-08-09')
5

In [14]:
mylist = []

In [15]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [16]:
sqlite3_df = pd.DataFrame(mylist)

In [17]:
print(sqlite3_df)

   id     name status   salary department position        data
0   1   Adunni    Yes   3000.0         IT       SR  2021-02-04
1   2   Mercy     Yes   2000.0         IT       MG  2021-06-08
2   3    Kayus    Yes  20000.0  Technical       Hr  2021-09-03
3   4  Kilanko    Yes  40000.0  Technical       Hr  2021-05-09
4   5     paul    YEs   4000.0         IT       MD  2021-08-09

# MYSQL Data Source

In [25]:
mydb = mysql.connector.connect(host="localhost",user="root",password="")

In [26]:
cursor = mydb.cursor()

In [31]:
cursor.execute("USE employees")

In [32]:
mydb = mysql.connector.connect(host="localhost",user="root",password="",database="employees")

In [34]:
#cursor.execute("CREATE TABLE IT (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
mydb.commit()

In [35]:
counter = True
while counter:
    name = input('Enter your name: ')
    status = input('Enter your status')
    salary = int(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    vals = (name,status,salary,department,position,date)
    sql = "INSERT INTO IT(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    cursor.execute(sql,vals)
    mydb.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your name: Winner Emeto
Enter your statusYes
Enter your salary: 200000
Enter your department: IT
Enter your position: MG
Enter date "YYYY-M-D": 2021-01-03
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Samuel A
Enter your statusYes
Enter your salary: 900000000
Enter your department: Technical
Enter your position: CEO
Enter date "YYYY-M-D": 2021-04-08
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Marvellous S
Enter your statusYes
Enter your salary: 300000
Enter your department: IT
Enter your position: Hr
Enter date "YYYY-M-D": 2021-09-09
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Sarah Abel
Enter your statusNo
Enter your salary: 2000
Enter your department: MN
Enter your position: Supervisor
Enter date "YYYY-M-D": 2021-09-09
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Mary Ojoyo
Enter your statusYes
Enter your salary: 4000
Enter your department: IT
Enter your position: MG
Enter date "YYYY-M-D": 2021-08-08
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

In [36]:
cursor.execute("SELECT * FROM IT")
rows = cursor.fetchall()

In [37]:
mylist = []

In [38]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [39]:
mysql_df = pd.DataFrame(mylist)
mysql_df

,id,name,status,salary,department,position,data
0,1,Emeto Winner,Yes,90000,IT,Facilitator,2021-08-04
1,2,Peter Obong,No,2000,maintenances,Cleaner,2021-08-01
2,3,Betty Irabor,Yes,200000,Technical,Data Analyst,2021-09-09
3,4,Adegbola Olorunloju,Yes,30000,Techncal,Quality Analyst,2021-08-01
4,5,Mercy Joy,Senior Data Scientist,4000000,IT,Senior Data Scientist,2021-08-08
5,6,Funmilayo Aina,Yes,2147483647,Technical,Chief Data Scientist,2021-09-09
6,7,Winner Emeto,Yes,200000,IT,MG,2021-01-03
7,8,Samuel A,Yes,900000000,Technical,CEO,2021-04-08
8,9,Marvellous S,Yes,300000,IT,Hr,2021-09-09
9,10,Sarah Abel,No,2000,MN,Supervisor,2021-09-09
10,11,Mary Ojoyo,Yes,4000,IT,MG,2021-08-08

# Mongo Data Source

In [40]:
myclient = pymongo.MongoClient('mongodb://localhost:27017') #initializing a mongodb connection

In [41]:
mydb = myclient['employees'] #createsadatabase called mydatabase

In [42]:
mycol = mydb['transactions'] #creates a table(collection) called customers

In [43]:
columns = ["id","name","product","amount","saleprice","status","date"]

In [44]:
counter = True
while counter:
    user_id = input("Id: ")
    name = input("Name: ")
    product= input("Product: ")
    amount = int(input("Amount: "))
    saleprice = float(input("Saleprice: "))
    status = input("Status: ")
    date = input("Date YYYY-M-D: ")

    mydict = {"_id":user_id,"name":name,"product":product,"amount":amount,"saleprice":saleprice,"status":status,"date":date}
    x = mycol.insert_one(mydict)

    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit: "))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Id: 17
Name: Marvel
Product: shoes
Amount: 90
Saleprice: 300000
Status: Branded
Date YYYY-M-D: 2022-02-09
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 18
Name: God is good
Product: Bible
Amount: 80
Saleprice: 2000
Status: Branded
Date YYYY-M-D: 2021-07-11
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 0
Thank you!!

In [45]:
x = mycol.find()
x

In [46]:
mylist = []

In [47]:
for data in x:
    mylist.append(data)
    print(data)

{'_id': '001', 'name': 'Mary A', 'product': 'book', 'amount': '900', 'saleprice': '15', 'status': 'sold', 'date': '2021-07-08'}
{'_id': '1', 'name': 'Aniita', 'product': 'Phone', 'amount': 2000, 'saleprice': 50000.0, 'status': 'Valid', 'date': '2021-07-08'}
{'_id': 'Mary', 'name': 'Mary', 'product': 'Car', 'amount': 2, 'saleprice': 5000000.0, 'status': 'Valid', 'date': '2021-07-08'}
{'_id': 'Kolawole', 'name': 'Kolawole', 'product': 'Car', 'amount': 4, 'saleprice': 1000000000.0, 'status': 'Valid', 'date': '2021-07-08'}
{'_id': '2', 'name': 'Mary', 'product': 'Car', 'amount': 2, 'saleprice': 2000000.0, 'status': 'Valid', 'date': '2021-07-08'}
{'_id': '11', 'name': 'marvellous A', 'product': 'Pen', 'amount': 20, 'saleprice': 300.0, 'status': 'Branded', 'date': '2021-03-04'}
{'_id': '12', 'name': 'Monday Goodness', 'product': 'Book', 'amount': 4, 'saleprice': 4000.0, 'status': 'Unbranded', 'date': '2021-05-09'}
{'_id': '15', 'name': 'Miracle A', 'product': 'car', 'amount': 4, 'saleprice': 9000000.0, 'status': 'Branded', 'date': '2022-01-01'}
{'_id': '14', 'name': 'Favour S', 'product': 'Houses', 'amount': 3, 'saleprice': 5000000.0, 'status': 'Branded', 'date': '2022-01-01'}
{'_id': '16', 'name': 'mARIA DB', 'product': 'ANY', 'amount': 100, 'saleprice': 1000.0, 'status': 'Unbranded', 'date': '2021-09-03'}
{'_id': '17', 'name': 'Marvel', 'product': 'shoes', 'amount': 90, 'saleprice': 300000.0, 'status': 'Branded', 'date': '2022-02-09'}
{'_id': '18', 'name': 'God is good', 'product': 'Bible', 'amount': 80, 'saleprice': 2000.0, 'status': 'Branded', 'date': '2021-07-11'}

In [48]:
print(mylist)

[{'_id': '001', 'name': 'Mary A', 'product': 'book', 'amount': '900', 'saleprice': '15', 'status': 'sold', 'date': '2021-07-08'}, {'_id': '1', 'name': 'Aniita', 'product': 'Phone', 'amount': 2000, 'saleprice': 50000.0, 'status': 'Valid', 'date': '2021-07-08'}, {'_id': 'Mary', 'name': 'Mary', 'product': 'Car', 'amount': 2, 'saleprice': 5000000.0, 'status': 'Valid', 'date': '2021-07-08'}, {'_id': 'Kolawole', 'name': 'Kolawole', 'product': 'Car', 'amount': 4, 'saleprice': 1000000000.0, 'status': 'Valid', 'date': '2021-07-08'}, {'_id': '2', 'name': 'Mary', 'product': 'Car', 'amount': 2, 'saleprice': 2000000.0, 'status': 'Valid', 'date': '2021-07-08'}, {'_id': '11', 'name': 'marvellous A', 'product': 'Pen', 'amount': 20, 'saleprice': 300.0, 'status': 'Branded', 'date': '2021-03-04'}, {'_id': '12', 'name': 'Monday Goodness', 'product': 'Book', 'amount': 4, 'saleprice': 4000.0, 'status': 'Unbranded', 'date': '2021-05-09'}, {'_id': '15', 'name': 'Miracle A', 'product': 'car', 'amount': 4, 'saleprice': 9000000.0, 'status': 'Branded', 'date': '2022-01-01'}, {'_id': '14', 'name': 'Favour S', 'product': 'Houses', 'amount': 3, 'saleprice': 5000000.0, 'status': 'Branded', 'date': '2022-01-01'}, {'_id': '16', 'name': 'mARIA DB', 'product': 'ANY', 'amount': 100, 'saleprice': 1000.0, 'status': 'Unbranded', 'date': '2021-09-03'}, {'_id': '17', 'name': 'Marvel', 'product': 'shoes', 'amount': 90, 'saleprice': 300000.0, 'status': 'Branded', 'date': '2022-02-09'}, {'_id': '18', 'name': 'God is good', 'product': 'Bible', 'amount': 80, 'saleprice': 2000.0, 'status': 'Branded', 'date': '2021-07-11'}]

In [49]:
mongoDB_df = pd.DataFrame(mylist)
mongoDB_df

         _id             name product amount saleprice     status        date
0        001           Mary A    book    900        15       sold  2021-07-08
1          1           Aniita   Phone   2000     50000      Valid  2021-07-08
2       Mary             Mary     Car      2     5e+06      Valid  2021-07-08
3   Kolawole         Kolawole     Car      4     1e+09      Valid  2021-07-08
4          2             Mary     Car      2     2e+06      Valid  2021-07-08
5         11     marvellous A     Pen     20       300    Branded  2021-03-04
6         12  Monday Goodness    Book      4      4000  Unbranded  2021-05-09
7         15        Miracle A     car      4     9e+06    Branded  2022-01-01
8         14         Favour S  Houses      3     5e+06    Branded  2022-01-01
9         16         mARIA DB     ANY    100      1000  Unbranded  2021-09-03
10        17           Marvel   shoes     90    300000    Branded  2022-02-09
11        18      God is good   Bible     80      2000    Branded  2021-07-11

In [51]:
#mongoDB_df['total'] = mongoDB_df['amount'] * mongoDB_df['saleprice']
mongoDB_df

         _id             name product amount saleprice     status        date
0        001           Mary A    book    900        15       sold  2021-07-08
1          1           Aniita   Phone   2000     50000      Valid  2021-07-08
2       Mary             Mary     Car      2     5e+06      Valid  2021-07-08
3   Kolawole         Kolawole     Car      4     1e+09      Valid  2021-07-08
4          2             Mary     Car      2     2e+06      Valid  2021-07-08
5         11     marvellous A     Pen     20       300    Branded  2021-03-04
6         12  Monday Goodness    Book      4      4000  Unbranded  2021-05-09
7         15        Miracle A     car      4     9e+06    Branded  2022-01-01
8         14         Favour S  Houses      3     5e+06    Branded  2022-01-01
9         16         mARIA DB     ANY    100      1000  Unbranded  2021-09-03
10        17           Marvel   shoes     90    300000    Branded  2022-02-09
11        18      God is good   Bible     80      2000    Branded  2021-07-11

# Pull Data Together

In [52]:
mysql_df

,id,name,status,salary,department,position,data
0,1,Emeto Winner,Yes,90000,IT,Facilitator,2021-08-04
1,2,Peter Obong,No,2000,maintenances,Cleaner,2021-08-01
2,3,Betty Irabor,Yes,200000,Technical,Data Analyst,2021-09-09
3,4,Adegbola Olorunloju,Yes,30000,Techncal,Quality Analyst,2021-08-01
4,5,Mercy Joy,Senior Data Scientist,4000000,IT,Senior Data Scientist,2021-08-08
5,6,Funmilayo Aina,Yes,2147483647,Technical,Chief Data Scientist,2021-09-09
6,7,Winner Emeto,Yes,200000,IT,MG,2021-01-03
7,8,Samuel A,Yes,900000000,Technical,CEO,2021-04-08
8,9,Marvellous S,Yes,300000,IT,Hr,2021-09-09
9,10,Sarah Abel,No,2000,MN,Supervisor,2021-09-09
10,11,Mary Ojoyo,Yes,4000,IT,MG,2021-08-08

In [53]:
sqlite3_df

   id     name status   salary department position        data
0   1   Adunni    Yes   3000.0         IT       SR  2021-02-04
1   2   Mercy     Yes   2000.0         IT       MG  2021-06-08
2   3    Kayus    Yes  20000.0  Technical       Hr  2021-09-03
3   4  Kilanko    Yes  40000.0  Technical       Hr  2021-05-09
4   5     paul    YEs   4000.0         IT       MD  2021-08-09

In [54]:
mongoDB_df

         _id             name product amount saleprice     status        date
0        001           Mary A    book    900        15       sold  2021-07-08
1          1           Aniita   Phone   2000     50000      Valid  2021-07-08
2       Mary             Mary     Car      2     5e+06      Valid  2021-07-08
3   Kolawole         Kolawole     Car      4     1e+09      Valid  2021-07-08
4          2             Mary     Car      2     2e+06      Valid  2021-07-08
5         11     marvellous A     Pen     20       300    Branded  2021-03-04
6         12  Monday Goodness    Book      4      4000  Unbranded  2021-05-09
7         15        Miracle A     car      4     9e+06    Branded  2022-01-01
8         14         Favour S  Houses      3     5e+06    Branded  2022-01-01
9         16         mARIA DB     ANY    100      1000  Unbranded  2021-09-03
10        17           Marvel   shoes     90    300000    Branded  2022-02-09
11        18      God is good   Bible     80      2000    Branded  2021-07-11

# Creating a Data Warehouse (Using MySQL)

In [55]:
# Connecting to MySQL Server
mydb = mysql.connector.connect(host="localhost",user="root",password="")

In [56]:
# Creating a Cursor object for ex
cursor = mydb.cursor()

In [57]:
# Creating Datawarehouse in MySQL
cursor.execute("CREATE DATABASE datawarehouse")

In [58]:
# Connecting to MySQL Server Datawarehouse
mydb = mysql.connector.connect(host="localhost",user="root",password="",database='datawarehouse')

In [59]:
# Creating a Cursor object for Datawarehouse
cursor = mydb.cursor()

# LOAD FUNCTIONS

In [60]:
def create_table(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
    mydb.commit()

In [61]:
def convert_dataframe(dataframe):
    data_dict = dataframe.to_dict()
    return data_dict

In [62]:
def insert_query(table):
    sql = f"INSERT INTO {table}(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    return sql

In [63]:
def load(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global status
        status = data_dict['status'][counter]
        global salary
        salary = data_dict['salary'][counter]
        global department
        department = data_dict['department'][counter]
        global position
        position = data_dict['position'][counter]
        global date
        date = data_dict['data'][counter]
        vals = (name,status,salary,department,position,date)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

# LOAD FUNCTIONS FOR MongoDB

In [64]:
def create_table_mdb(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), product VARCHAR(255), amount INT, saleprice INT, status VARCHAR(255), date VARCHAR(255), total VARCHAR(255))")
    mydb.commit()

In [65]:
def insert_query_mdb(table):
    sql = f"INSERT INTO {table}(name,product,amount,saleprice,status,date,total) VALUES(%s,%s,%s,%s,%s,%s,%s)"
    return sql

In [66]:
def load_mdb(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global product
        product = data_dict['product'][counter]
        global amount
        amount = data_dict['amount'][counter]
        global saleprice
        saleprice = data_dict['saleprice'][counter]
        global status
        status = data_dict['status'][counter]
        global date
        date = data_dict['date'][counter]
        global total
        total = data_dict['total'][counter]
        vals = (name,product,amount,saleprice,status,date,total)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

# MySQL Table in Datawarehouse to store MySQL data source

In [67]:
create_table("IT")

In [68]:
mysql_dict = convert_dataframe(mysql_df)
mysql_dict.pop('id')
mysql_dict

{'name': {0: 'Emeto Winner',
  1: 'Peter Obong',
  2: 'Betty Irabor',
  3: 'Adegbola Olorunloju',
  4: 'Mercy Joy',
  5: 'Funmilayo Aina',
  6: 'Winner Emeto',
  7: 'Samuel A',
  8: 'Marvellous S',
  9: 'Sarah Abel',
  10: 'Mary Ojoyo'},
 'status': {0: 'Yes',
  1: 'No',
  2: 'Yes',
  3: 'Yes',
  4: 'Senior Data Scientist',
  5: 'Yes',
  6: 'Yes',
  7: 'Yes',
  8: 'Yes',
  9: 'No',
  10: 'Yes'},
 'salary': {0: 90000,
  1: 2000,
  2: 200000,
  3: 30000,
  4: 4000000,
  5: 2147483647,
  6: 200000,
  7: 900000000,
  8: 300000,
  9: 2000,
  10: 4000},
 'department': {0: 'IT',
  1: 'maintenances',
  2: 'Technical',
  3: 'Techncal',
  4: 'IT',
  5: 'Technical',
  6: 'IT',
  7: 'Technical',
  8: 'IT',
  9: 'MN',
  10: 'IT'},
 'position': {0: 'Facilitator',
  1: 'Cleaner',
  2: 'Data Analyst',
  3: 'Quality Analyst',
  4: 'Senior Data Scientist',
  5: 'Chief Data Scientist',
  6: 'MG',
  7: 'CEO',
  8: 'Hr',
  9: 'Supervisor',
  10: 'MG'},
 'data': {0: '2021-08-04',
  1: '2021-08-01',
  2: '2021-09-09',
  3: '2021-08-01',
  4: '2021-08-08',
  5: '2021-09-09',
  6: '2021-01-03',
  7: '2021-04-08',
  8: '2021-09-09',
  9: '2021-09-09',
  10: '2021-08-08'}}

In [69]:
sql = insert_query("IT")
load(mysql_dict,sql)

All data has been inserted!!!

# SQLITE3 Table in Datawarehouse to store SQLite3 data source

In [70]:
create_table("HR")

In [71]:
sqlite3_dict = convert_dataframe(sqlite3_df)
sqlite3_dict.pop("id")
sqlite3_dict

{'name': {0: 'Adunni', 1: 'Mercy ', 2: 'Kayus', 3: 'Kilanko', 4: 'paul'},
 'status': {0: 'Yes', 1: 'Yes', 2: 'Yes', 3: 'Yes', 4: 'YEs'},
 'salary': {0: 3000.0, 1: 2000.0, 2: 20000.0, 3: 40000.0, 4: 4000.0},
 'department': {0: 'IT', 1: 'IT', 2: 'Technical', 3: 'Technical', 4: 'IT'},
 'position': {0: 'SR', 1: 'MG', 2: 'Hr', 3: 'Hr', 4: 'MD'},
 'data': {0: '2021-02-04',
  1: '2021-06-08',
  2: '2021-09-03',
  3: '2021-05-09',
  4: '2021-08-09'}}

In [72]:
sql = insert_query("HR")
load(sqlite3_dict,sql)

All data has been inserted!!!

# MongoDB Table in Datawarehouse to store MongoDB data source

In [73]:
create_table_mdb("transactions")

In [74]:
mongodb_dict = convert_dataframe(mongoDB_df)
mongodb_dict.pop("_id")
mongodb_dict

{'name': {0: 'Mary A',
  1: 'Aniita',
  2: 'Mary',
  3: 'Kolawole',
  4: 'Mary',
  5: 'marvellous A',
  6: 'Monday Goodness',
  7: 'Miracle A',
  8: 'Favour S',
  9: 'mARIA DB',
  10: 'Marvel',
  11: 'God is good'},
 'product': {0: 'book',
  1: 'Phone',
  2: 'Car',
  3: 'Car',
  4: 'Car',
  5: 'Pen',
  6: 'Book',
  7: 'car',
  8: 'Houses',
  9: 'ANY',
  10: 'shoes',
  11: 'Bible'},
 'amount': {0: '900',
  1: 2000,
  2: 2,
  3: 4,
  4: 2,
  5: 20,
  6: 4,
  7: 4,
  8: 3,
  9: 100,
  10: 90,
  11: 80},
 'saleprice': {0: '15',
  1: 50000.0,
  2: 5000000.0,
  3: 1000000000.0,
  4: 2000000.0,
  5: 300.0,
  6: 4000.0,
  7: 9000000.0,
  8: 5000000.0,
  9: 1000.0,
  10: 300000.0,
  11: 2000.0},
 'status': {0: 'sold',
  1: 'Valid',
  2: 'Valid',
  3: 'Valid',
  4: 'Valid',
  5: 'Branded',
  6: 'Unbranded',
  7: 'Branded',
  8: 'Branded',
  9: 'Unbranded',
  10: 'Branded',
  11: 'Branded'},
 'date': {0: '2021-07-08',
  1: '2021-07-08',
  2: '2021-07-08',
  3: '2021-07-08',
  4: '2021-07-08',
  5: '2021-03-04',
  6: '2021-05-09',
  7: '2022-01-01',
  8: '2022-01-01',
  9: '2021-09-03',
  10: '2022-02-09',
  11: '2021-07-11'}}

In [77]:
#sql = insert_query_mdb("transactions")
#load_mdb(mongodb_dict,sql)